Repository: interlegis/dx-job-controller
Catalog: docs/source/locale/*/LC_MESSAGES/admin_interface.po
Languages: pt_br

source: Admin interface
pt_br: Interface administrativa

source: synopsis
pt_br: sinopse

source: Django admin interface to manage cronjobs.
pt_br: Interface administrativa do Django para gerenciar cron jobs.

source: Once installed, **dx-job-controller** is available in the Django admin interface panel with two accessible classes:
pt_br: Após a instalação, o **dx-job-controller** estará disponível no painel de administração do Django com duas classes acessíveis:

source: Cronjobs
pt_br: Jobs agendados

source: The ``Cronjobs`` class allows you to view and manage all existing jobs in the system:
pt_br: A classe ``Jobs agendados`` permite visualizar e gerenciar todos os jobs existentes no sistema:

source: The **run** column in the listview allows you to run the job immediately.
pt_br: A coluna **executar** na listview permite executar o job imediatamente.

source: In the change form of `Cronjobs` is possible to configure the execution of the job (see: :doc:`managing_jobs`):
pt_br: No `change form` de `Jobs agendados` é possível configurar a execução da tarefa (consulte: :doc:`managing_jobs`):

source: The list of job schedules is displayed as a `TabularInline`. The **view/run** column provides the oportunity to run (if job schedule is in Scheduled status) or view details of scheduled execution.
pt_br: A lista de `executar agendamentos` é exibida como um `TabularInline`. A coluna **ver/executar** oferece a opção de executar (se o agendamento da tarefa estiver com status Agendado) ou visualizar os detalhes da execução agendada.

source: Schedules
pt_br: Agendamentos

source: The `Run schedules` listview lists all scheduled job executions. You can filter by `status` (scheduled, running, finished) and by `cronjob`:
pt_br: A listview de executar agendamento exibe todas as execuções de tarefas agendadas. Você pode filtrar por `status` (agendado, em execução, concluído) e por `cronjob`:

source: It also has a **run** column to immediately run the scheduled job.
pt_br: Também possui uma coluna **executar** para executar imediatamente a tarefa agendada.

source: The schedules `View form` displays details of execution:
pt_br: O `View form` dos agendamentos exibe detalhes da execução:
