Repository: interlegis/dx-job-controller
Catalog: docs/source/locale/*/LC_MESSAGES/digest_mail.po
Languages: pt_br

source: Digest mail
pt_br: E-mail de resumo

source: synopsis
pt_br: sinopse

source: Explains digest mail functionality
pt_br: Explica a funcionalidade do e-mail de resumo

source: How it works
pt_br: Como funciona

source: Jobs are executed within a `try` ... `exception` block. If an exception is thrown, its error message is persisted in the `result` field of the `Jobschedule` object.
pt_br: Os jobs são executados dentro de um bloco `try` ... `exception`. Se uma exceção for lançada, sua mensagem de erro será persistida no campo `result` do objeto `Jobschedule`.

source: Additionally, the outputs of `stdout` and `stderr` are captured and persisted in the same way as error messages.
pt_br: Além disso, as saídas de `stdout` e `stderr` são capturadas e persistidas da mesma forma que as mensagens de erro.

source: When an error occurs, either due to an exception or some text present in `stderr`, the `has_error` flag in the `Jobschedule` object is set to `True` to indicate that this execution encountered problems.
pt_br: Quando ocorre um erro, seja devido a uma exceção ou a algum texto presente em `stderr`, o flag `has_error` no objeto `Jobschedule` é definido como `True` para indicar que esta execução encontrou problemas.

source: Therefore, when writing your jobs, it is a good practice to throw exceptions when critical problems that prevent the `job` from completing occur, and to send non-critical error and warning messages to `stderr`. To print to `stderr` in Python, use the syntax:
pt_br: Portanto, ao escrever seus jobs, é uma boa prática lançar exceções quando problemas críticos que impedem a conclusão do `job` ocorrerem, e enviar mensagens de erro e aviso não críticos para `stderr`. Para imprimir em `stderr` em Python, use a sintaxe:

source: If necessary, explanatory messages can be sent to `stdout`.
pt_br: Se necessário, mensagens explicativas podem ser enviadas para `stdout`.

source: Execution summaries
pt_br: Resumos de execução

source: Execution summaries are produced by combining one or more execution logs, depending on the frequency of summary submissions.
pt_br: Os resumos de execução são produzidos combinando um ou mais logs de execução, dependendo da frequência de envio dos resumos.

source: Two templates are used to generate the summary report:
pt_br: Dois templates são usados ​​para gerar o relatório de resumo:

source: `job_controller/digest_txt.html` and
pt_br: `job_controller/digest_txt.html` e

source: The first generates a plain text containing the logs to be sent, and the other generates an HTML snippet of the same logs.
pt_br: O primeiro gera um texto simples contendo os logs a serem enviados, e o outro gera um trecho HTML dos mesmos logs.

source: Both templates receive the following context variables:
pt_br: Ambos os templates recebem as seguintes variáveis ​​de contexto:

source: **job**: The Cronjob object being processed
pt_br: **job**: O objeto Cronjob que está sendo processado

source: **rounds**: A queryset containing all the logs that will be reported in the summary.
pt_br: **rounds**: Um queryset contendo todos os logs que serão relatados no resumo.

source: Sending emails
pt_br: Enviando emails

source: To send emails we use the `send_mail` function from the `django.core.mail` package (`see Django sending email <https://docs.djangoproject.com/en/5.2/topics/email/#send-mail>`__).
pt_br: Para enviar emails, usamos a função `send_mail` do pacote `django.core.mail` (`consulte Django sending email <https://docs.djangoproject.com/en/5.2/topics/email/#send-mail>`__).

source: The text produced with the `digest_txt.html` template is sent as a `message` and the html snippet produced by the `digest_html.html` template is sent as `html_message` in case the recipient's email client is able to display html.
pt_br: O texto produzido com o template `digest_txt.html` é enviado como `message` e o trecho de HTML produzido pelo template `digest_html.html` é enviado como `html_message`, para o caso do cliente de e-mail do destinatário ser capaz de exibir HTML.

source: The email sender (`from_email` parameter of `send_mail` function) is set to ``settings.SERVER_EMAIL``, the same email address that Django uses to send error messages.
pt_br: O remetente do e-mail (parâmetro `from_email` da função `send_mail`) é definido como ``settings.SERVER_EMAIL``, o mesmo endereço de e-mail que o Django usa para enviar mensagens de erro.

source: Email sending fails silently if the SMTP server is not correctly configured in the Django settings or if some other problem occurs.
pt_br: O envio de e-mail falha silenciosamente se o servidor SMTP não estiver corretamente configurado nas configurações do Django ou se ocorrer algum outro problema.

source: Customizing summaries
pt_br: Personalizando resumos

source: You can customize the appearance of summary reports by overwriting the templates.
pt_br: Você pode personalizar a aparência dos relatórios de resumo sobrescrevendo os templates.

source: To define your own templates, create a `job_controller` folder inside the `templates` folder of your project or in the `templates` folder of some app in your project and then write the desired new template inside that folder, keeping the original template names.
pt_br: Para definir seus próprios templates, crie uma pasta `job_controller` dentro da pasta `templates` do seu projeto ou na pasta `templates` de algum aplicativo do seu projeto e, em seguida, escreva o novo template desejado dentro dessa pasta, mantendo os nomes dos templates originais.

source: The original templates are these:
pt_br: Os templates originais são estes:
