Repository: interlegis/dx-job-controller
Catalog: docs/source/locale/*/LC_MESSAGES/index.po
Languages: pt_br

source: Welcome to dx-job-controller's documentation!
pt_br: Bem-vindo à documentação do dx-job-controller!

source: **Dx-job-controller** is a Django admin interface for managing cronjobs created with the `django-extensions package <https://django-extensions.readthedocs.io/en/latest/jobs_scheduling.html>`__
pt_br: **Dx-job-controller** é uma interface admin do Django para gerenciar cronjobs criados com o pacote `django-extensions <https://django-extensions.readthedocs.io/en/latest/jobs_scheduling.html>`__

source: Main features:
pt_br: Principais recursos:

source: cronjob management via the Django admin interface,
pt_br: gerenciamento de cronjobs via interface admin do Django,

source: defines the execution time of each job directly in the interface, without the need for changes to the crontab,
pt_br: define o tempo de execução de cada job diretamente na interface, sem a necessidade de alterações no crontab,

source: executes concurrent jobs using `threading <https://docs.python.org/3/library/threading.html>`__,
pt_br: executa jobs simultâneos usando `threading <https://docs.python.org/3/library/threading.html>`__,

source: retains job messages with each run (log),
pt_br: retém as mensagens de job a cada execução (log),

source: sends emails with log summaries.
pt_br: envia e-mails com resumos de log.

source: Getting Started
pt_br: Primeiros passos

source: You can get dx-job-controller by using pip::
pt_br: Você pode obter o dx-job-controller usando o pip::

source: If you want to install it from source, pip directly from git repository::
pt_br: Se você quiser instalá-lo a partir do código-fonte, use o pip diretamente do repositório git::

source: For more detailed instructions check out our :doc:`installation_instructions`. Enjoy.
pt_br: Para instruções mais detalhadas, consulte nossas :doc:`installation_instructions`. Aproveite.

source: Compatibility with versions of Python and Django
pt_br: Compatibilidade com versões do Python e do Django

source: We follow the Django guidelines for supported Python and Django versions. See more at `Django Supported Versions <https://docs.djangoproject.com/en/dev/internals/release-process/#supported-versions>`__
pt_br: Seguimos as diretrizes do Django para versões suportadas do Python e do Django. Veja mais em `Versões Suportadas do Django <https://docs.djangoproject.com/en/dev/internals/release-process/#supported-versions>`__

source: This might mean the dx-job-controller may work with older or unsupported versions but we do not guarantee it and most likely will not fix bugs related to incompatibilities with older versions.
pt_br: Isso pode significar que o dx-job-controller pode funcionar com versões mais antigas ou não suportadas mas não garantimos isso e provavelmente não corrigiremos bugs relacionados a incompatibilidades com versões mais antigas.

source: Contents
pt_br: Conteúdo
