Repository: interlegis/dx-job-controller
Catalog: docs/source/locale/*/LC_MESSAGES/installation_instructions.po
Languages: pt_br

source: Installation instructions
pt_br: Instruções de instalação

source: synopsis
pt_br: sinopse

source: Installing dx-job-controller
pt_br: Instalando dx-job-controller

source: Installing
pt_br: Instalando

source: You can use pip to install dx-job-controller for usage::
pt_br: Você pode usar o pip para instalar o dx-job-controller usando::

source: Development
pt_br: Desenvolvimento

source: dx-job-controller is hosted on github::
pt_br: O dx-job-controller está hospedado no GitHub::

source: Source code can be accessed by performing a Git clone.
pt_br: O código-fonte pode ser acessado clonando o repositório Git.

source: Tracking the development version of *dx-job-controller* should be pretty stable and will keep you up-to-date with the latest fixes.
pt_br: Acompanhar a versão de desenvolvimento do *dx-job-controller* deve ser bastante estável e manterá você atualizado com as correções mais recentes.

source: You find the sources in src/job-controller now.
pt_br: Você encontra os arquivos-fonte em src/job-controller agora.

source: Keep in mind that the current code in the git repository may be different from the packaged release. It may contain bugs and backwards-incompatible changes but most likely also new goodies to play with.
pt_br: Lembre-se de que o código atual no repositório git pode ser diferente da versão empacotada. Ele pode conter bugs e alterações incompatíveis com versões anteriores, mas provavelmente também novas funcionalidades interessantes para experimentar.

source: Configuration
pt_br: Configuração

source: To enable `dx-job-controller` in your project you need to add ``job_controller`` and ``django_extensions`` to ``INSTALLED_APPS`` in your project's `settings.py` file:
pt_br: Para habilitar o `dx-job-controller` em seu projeto, você precisa adicionar ``job_controller`` e ``django_extensions`` a ``INSTALLED_APPS`` no arquivo `settings.py` do seu projeto:

source: run ``python manage.py migrate`` to create dx-job-controller database tables.
pt_br: execute ``python manage.py migrate`` para criar as tabelas do banco de dados do dx-job-controller.

source: The next time you run your project and access the Django admin, voila! it will already have the Job controller app listed in your admin dashboard!
pt_br: Na próxima vez que você executar seu projeto e acessar o painel de administração do Django, voilà! ele já terá o aplicativo Job controller listado no seu painel de administração!

source: To ensure that django-extensions jobs are loaded and run, add the following entry to your `crontab <https://man7.org/linux/man-pages/man5/crontab.5.html>`__:
pt_br: Para garantir que os jobs do django-extensions sejam carregados e executados, adicione a seguinte entrada ao seu `crontab <https://man7.org/linux/man-pages/man5/crontab.5.html>`__:

source: this runs the ``job_controller`` job every minute and adds its output to the file `/var/log/django_cron.log`. See :doc:`job_controller` for more details.
pt_br: Isso executa o job ``job_controller`` a cada minuto e adiciona sua saída ao arquivo `/var/log/django_cron.log`. Consulte :doc:`job_controller` para mais detalhes.
