Repository: interlegis/dx-job-controller
Catalog: docs/source/locale/*/LC_MESSAGES/job_controller.po
Languages: pt_br

source: Job controller
pt_br: Job controller - controlador de jobs

source: synopsis
pt_br: sinopse

source: How the job-controller works
pt_br: Como o job controller funciona

source: The job controller is a common job created with `django-extensions` to control other jobs in the system. Ideally, it should run every minute, but this isn't mandatory and will depend on your needs.
pt_br: O job controller é um job comum criado com `django-extensions` para controlar outros jobs no sistema. Idealmente, ele deve ser executado a cada minuto, mas isso não é obrigatório e dependerá das suas necessidades.

source: Its ``run`` method executes the following tasks in sequence:
pt_br: Seu método ``run`` executa as seguintes tarefas em sequência:

source: Remove old jobs
pt_br: Remove jobs antigos

source: Remove from the jobs table those that were removed from the code. Whenever a job is removed from the code, its record in the `cronjobs` table is also removed, along with all execution and scheduling records.
pt_br: Remove da tabela de jobs aqueles que foram removidos do código. Sempre que um job é removido do código, seu registro na tabela `cronjobs` também é removido, juntamente com todos os registros de execução e agendamento.

source: Sync new jobs
pt_br: Sincronizar novos jobs

source: Add in the jobs table those new jobs that were been created in the code. Whenever a new job is created in the code, a record in the cronjobs table is added to represent it in the admin interface.
pt_br: Adiciona à tabela de jobs os novos jobs que foram criados no código. Sempre que um novo job é criado no código, um registro na tabela cronjobs é adicionado para representá-lo na interface administrativa.

source: Run scheduled jobs
pt_br: Executar jobs agendados

source: IdentiIdentifies the jobs that are scheduled to run at this time (scheduled start is less than or equal to now) and invokes them encapsulated in a ``threading.Thread`` object to take advantage from execution parallelism.
pt_br: Identifica os jobs agendados para serem executados neste momento (início agendado é menor ou igual a agora) e os invoca encapsulados em um objeto ``threading.Thread`` para aproveitar o paralelismo de execução.

source: The schedule status is changed to `Running` to ensure that neither the user nor another instance of the `job-controller` starts another job execution.
pt_br: O status do agendamento é alterado para `Em execução` para garantir que nem o usuário nem outra instância do `job-controller` inicie outra execução deste job.

source: If the running job throws any exception, the error message will be captured and saved in the `Jobschedule` result field and the `has_errors` field will be set to True.
pt_br: Se o job em execução gerar alguma exceção, a mensagem de erro será capturada e salva no campo `result` do `Jobschedule` e o campo `has_errors` será definido como True.

source: `Stdout` and `stderr` are captured and added to the Jobschedule's `result` field. If there is any text in `stderr`, the `has_errors` field is set to True.
pt_br: `Stdout` e `stderr` são capturados e adicionados ao campo `result` do Jobschedule. Se houver algum texto em `stderr`, o campo `has_errors` será definido como True.

source: Schedule jobs
pt_br: Agendar jobs

source: Creates scheduling records to the next execution for jobs that do not have any records with the status `running` or `scheduled`.
pt_br: Cria registros de agendamento para a próxima execução dos jobs que não têm registros com o status `em execução` ou `agendado`.

source: Digest emails
pt_br: E-mails de resumo

source: Generates log summary and send it by email.
pt_br: Gera um resumo de log e o envia por e-mail.

source: Remove old logs
pt_br: Remove logs antigos

source: Delete old logs from database.
pt_br: Exclui logs antigos do banco de dados.
