Repository: interlegis/dx-job-controller
Catalog: docs/source/locale/*/LC_MESSAGES/managing_jobs.po
Languages: pt_br

source: Managing jobs
pt_br: Gerenciando jobs

source: synopsis
pt_br: sinopse

source: How to manage your jobs in *dx-job-controller* admin interface
pt_br: Como gerenciar seus jobs na interface administrativa do *dx-job-controller*

source: After ``job_controller`` runs the first time (normally triggered by cron) the `Cronjob` table is populated with all jobs found in each app in your project.
pt_br: Após a primeira execução do ``job_controller`` (normalmente acionada pelo cron) a tabela `Cronjob` é preenchida com todos os jobs encontrados em cada aplicativo do seu projeto.

source: Each `Cronjob` entry has the following fields:
pt_br: Cada entrada `Cronjob` possui os seguintes campos:

source: **job** (Readonly): the cronjob class name,
pt_br: **job** (Somente leitura): o nome da classe do cronjob,

source: **app** (Readonly): the app name where the cronjob was defined,
pt_br: **app** (Somente leitura): o nome do aplicativo onde o cronjob foi definido,

source: **description** (Readonly): the cronjob `docstring` and/or cronjob `help` attribute,
pt_br: **descrição** (Somente leitura): a `docstring` e/ou o atributo `help` do cronjob

source: **CRON expression**: the moment that this job will be run, in standard `crontab format <https://help.ubuntu.com/community/CronHowto>`__,
pt_br: **Expressão CRON**: o momento em que este job será executado, no formato padrão `crontab <https://help.ubuntu.com/community/CronHowto>`__,

source: **days to retain log**: Number of days that execution logs will be kept in the database. Zero means the log will never be deleted,
pt_br: **Dias para reter o log**: Número de dias que os logs de execução serão mantidos no banco de dados. Zero significa que o log nunca será excluído,

source: **email recipient(s)**: a list of emails to send job execution reports, one per line,
pt_br: **Destinatário(s) do e-mail**: uma lista de e-mails para enviar relatórios de execução do job, um e-mail por linha,

source: **days to digest**: How many days to wait to make a summary of reports, zero means the email should be sent immediately after execution,
pt_br: **dias para gerar o resumo**: Quantos dias esperar para gerar um resumo dos relatórios, zero significa que o e-mail deve ser enviado imediatamente após a execução,

source: **report just errors**: Send reports by email only when job execution error occurs,
pt_br: **relatar apenas erros**: Enviar relatórios por e-mail somente quando ocorrer um erro na execução do job,

source: **last digest submission** (Readonly): the last time the execution report email was sent.
pt_br: **última submissão de digest** (Somente leitura): a última vez que o e-mail do relatório de execução foi enviado.

source: Defining when a job should run
pt_br: Definindo quando um job deve ser executado

source: for each job you can set the ``CRON expression`` to define when this job will be executed.
pt_br: Para cada job, você pode definir a ``expressão CRON`` para definir quando este job será executado.

source: Cron expressions must have the standard crontab format (see: `CronHowto <https://help.ubuntu.com/community/CronHowto>`__). They are evaluated by the `cron-converter <https://pypi.org/project/cron-converter/>`__ component (thanks `Andrea Salvatori <https://github.com/Sonic0>`__).
pt_br: As expressões cron devem ter o formato padrão do crontab (consulte: `CronHowto <https://help.ubuntu.com/community/CronHowto>`__). Elas são avaliadas pelo componente `cron-converter <https://pypi.org/project/cron-converter/>`__ (obrigado, `Andrea Salvatori <https://github.com/Sonic0>`__).

source: When the Crontab table is populated, the `when` property of the Job class is evaluated to set the initial value of the `CRON expression`:
pt_br: Quando a tabela Crontab é preenchida, a propriedade `when` da classe Job é avaliada para definir o valor inicial da `expressão CRON`:

source: when / crontab equivalece table
pt_br: when / tabela de equivalência crontab

source: when property
pt_br: propriedade when

source: Result `CRON expression`
pt_br: Expressão CRON resultante

source: minutely
pt_br: minutely (minuto a minuto)

source: QuarterHourly
pt_br: QuarterHourly (quinze minutos)

source: hourly
pt_br: hourly (hora em hora)

source: daily
pt_br: daily (diariamente)

source: weekly
pt_br: weekly (semanalmente)

source: monthly
pt_br: monthly (mensalmente)

source: yearly
pt_br: yearly (anualmente)

source: If the Job class does not have a ``when`` attribute or if its value is not in the above table, then the cron expression used is ``0 0 * * *`` (`daily`).
pt_br: Se a classe Job não tiver um atributo ``when`` ou se o seu valor não estiver na tabela acima, a expressão cron usada será ``0 0 * * *`` (`daily`).

source: Job reports
pt_br: Relatórios de jobs

source: **dx-job-controller** collects job output and saves it as run logs. These logs are available for viewing and can be emailed as summary reports.
pt_br: O **dx-job-controller** coleta a saída dos jobs e a salva como logs de execução. Esses logs estão disponíveis para visualização e podem ser enviados por e-mail como relatórios resumidos.

source: Log retention time
pt_br: Tempo de retenção dos logs

source: You can set the number of days that logs will be kept in the database. After this period, the execution logs will be permanently deleted.
pt_br: Você pode definir o número de dias que os logs serão mantidos no banco de dados. Após esse período, os logs de execução serão excluídos permanentemente.

source: Email summaries
pt_br: Resumos por e-mail

source: **dx-job-controller** can email log summaries to a list of users provided by the ``email recipient(s)`` field. The summary is composed by concatenation of all logs generated in previous runs of a job.
pt_br: O **dx-job-controller** pode enviar resumos de logs por e-mail para uma lista de usuários fornecida pelo campo ``destinatário(s) de e-mail``. O resumo é composto pela concatenação de todos os logs gerados em execuções anteriores de um job.

source: Admin users can set the frequency, in days, of sending the summary email in the field ``days to digest``.
pt_br: Os usuários administradores podem definir a frequência, em dias, de envio do e-mail de resumo no campo ``dias para resumo``.

source: If the ``report just errors`` field is checked, only logs from runs where errors occurred will be added to the summary.
pt_br: Se o campo ``relatar apenas erros`` estiver marcado, somente os registros de execuções onde ocorreram erros serão adicionados ao resumo.
