Repository: interlegis/dx-job-controller
Catalog: src/job_controller/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: view/run
pt_br: ver/executar

source: next schedule
pt_br: próximo agendamento

source: No schedules for this job
pt_br: Nenhum agendamento para este job

source: scheduled start for {start}
pt_br: início agendado para {start}

source: running since {start}
pt_br: em execução desde {start}

source: executed at {started}, taking {time_spent} to complete
pt_br: executado em {started}, levando {time_spent} para concluir

source: run
pt_br: executar

source: This schedule cannot be executed because its status is {status}
pt_br: Esta tarefa não pode ser executada porque seu status é {status}

source: Job executed!
pt_br: Tarefa executada!

source: Job cannot be runned!
pt_br: A tarefa não pode ser executada!

source: Main job controller
pt_br: Controlador de tarefas principal

source: Running job controller
pt_br: Executando o controlador de tarefas

source: Remove from the jobs table those that were removed from the code...
pt_br: Remove da tabela de tarefas aquelas que foram removidas do código...

source: Update the jobs table with the new jobs that have been created...
pt_br: Atualiza a tabela de tarefas com as novas tarefas que foram criadas...

source: New job found at {app_name}: {job_name}: {help}
pt_br: Nova tarefa encontrada em {app_name}: {job_name}: {help}

source: Run scheduled jobs...
pt_br: Executar tarefas agendadas...

source: no job to run
pt_br: nenhuma tarefa para executar

source: {job_name} started at {start}
pt_br: {job_name} iniciado em {start}

source: Error trying run job {job_name}: job schedule in '{status}' status.
pt_br: Erro ao tentar executar a tarefa {job_name}: agendamento de tarefas com status '{status}'.

source: {job_name} finished at {finish}
pt_br: {job_name} finalizado em {finish}

source: Create schedule for next run...
pt_br: Criar agendamento para a próxima execução...

source: Scheduled job {job_name} for {start}
pt_br: Tarefa {job_name} agendada para {start}

source: Delete old logs...
pt_br: Excluir logs antigos...

source: one log deleted from '{job}' job
pt_br: Um registro excluído da tarefa '{job}'

source: Generate log summary and send by email...
pt_br: Gerar resumo do log e enviar por e-mail...

source: Digest JOB: {job_name}
pt_br: Resumo do JOB: {job_name}

source: CRON expression
pt_br: Expressão CRON

source: Use expressions in standard CRON format:<br/> <code>minute hour day month day-of-week</code><br/> More details: <a href='https://help.ubuntu.com/community/CronHowto'>CronHowTo</a>
pt_br: Use expressões no formato CRON padrão:<br/> <code>minuto hora dia mês dia-da-semana</code><br/> Mais detalhes: <a href='https://help.ubuntu.com/community/CronHowto'>CronHowTo</a>

source: days to retain log
pt_br: dias para reter o log

source: Number of days that execution logs will be kept in the database. Zero means the log will never be deleted.
pt_br: Número de dias que os logs de execução serão mantidos no banco de dados. Zero significa que o log nunca será excluído.

source: email recipient(s)
pt_br: destinatário(s) do e-mail

source: E-mails to send job execution reports.<br/>Enter one email address per line. Leave empty to not send e-mail reports
pt_br: E-mails para enviar relatórios de execução de tarefas.<br/>Insira um endereço de e-mail por linha. Deixe em branco para não enviar relatórios por e-mail

source: days to digest
pt_br: dias para gerar o resumo

source: How many days to wait to make a summary of reports.<br/>zero means the email should be sent immediately after execution.
pt_br: Quantos dias esperar para gerar um resumo dos relatórios.<br/>zero significa que o e-mail deve ser enviado imediatamente após a execução.

source: report just errors
pt_br: reportar apenas erros

source: Send reports by email only when job execution error occurs
pt_br: Enviar relatórios por e-mail somente quando ocorrer um erro de execução do job

source: last digest submission
pt_br: última submissão de digest

source: description
pt_br: descrição

source: The job {app_name}.{job_name} was not found.
pt_br: A tarefa {app_name}.{job_name} não foi encontrada.

source: Cron job
pt_br: Job agendado

source: Cron jobs
pt_br: Jobs agendados

source: The JOB routine {job_name} of the app {app_name} was not found.
pt_br: A rotina JOB {job_name} do aplicativo {app_name} não foi encontrada.

source: MESSAGES
pt_br: MENSAGENS

source: ERRORS
pt_br: ERROS

source: Job aborted with error: {str_err}
pt_br: Job abortado com erro: {str_err}

source: Scheduled
pt_br: Agendado

source: Running
pt_br: Em execução

source: Finished
pt_br: Concluído

source: cron job
pt_br: tarefa cron

source: start at
pt_br: iniciar em

source: started at
pt_br: iniciado em

source: time spent on execution
pt_br: tempo gasto na execução

source: execution result
pt_br: resultado da execução

source: has errors
pt_br: apresenta erros

source: run schedule
pt_br: executar agendamento

source: run schedules
pt_br: executar agendamentos

source: no time
pt_br: sem tempo

source: one day
pt_br: um dia

source: one hour
pt_br: uma hora

source: one minute
pt_br: um minuto

source: one second
pt_br: um segundo

source: one microsecond
pt_br: um microssegundo

source: {job_name}: scheduled start for {start}.
pt_br: {job_name}: início agendado para {start}.

source: {job_name}: running since {started}
pt_br: {job_name}: em execução desde {started}

source: {job_name}: run on {started}, taking {time_spent} to complete
pt_br: {job_name}: executado em {started}, levando {time_spent} para concluir

source: report
pt_br: relatório

source: Last {digest_days} days
pt_br: Últimos {digest_days} dias

source: runned at %(started)s taking %(time_spent)s to finish:
pt_br: executado em %(started)s, levando %(time_spent)s para terminar:

source: no reports
pt_br: nenhum relatório

source: * runned at %(started)s taking %(time_spent)s to finish:
pt_br: * executado em %(started)s, levando %(time_spent)s para terminar:
